In [1]:
# CIS 545

In [1]:
!pip install nltk --user

Requirement already satisfied: nltk in /home/jovyan/.local/lib/python3.6/site-packages (3.4)
Requirement already satisfied: singledispatch in /home/jovyan/.local/lib/python3.6/site-packages (from nltk) (3.4.0.3)
Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from nltk) (1.12.0)

In [2]:
## CIS 545 Homework 1 - Spring 2019
# Updated January 2019

# CIS 545 Homework 1: Data Wrangling and Analysis
### Due February 11, 2019 by 10pm

Big data analytics often requires (1) importing data from multiple sources, possibly extracting content from text; then (2) combining data from multiple sources, possibly from multiple different organizations, in heterogeneous formats.  For this assignment, our primary goals are to get you comfortable with importing, extracting, saving, and combining data -- largely using `Pandas DataFrames` as the basic abstraction.  You’ll read data from files, address issues with missing values, save the data in a database, combine the data, and generate visualizations.

*The Task*     
Most of you likely were on a plane over the summer, and chances are that at least one of your flights got delayed.  Did you ever wonder how well different airlines do?  We’ll answer those questions in this assignment!  (Caveat: with apologies to international travelers, most of the data is only available for US cities and routes!)

*Terminology*      
We’ll generally use `field`, `column`, and `attribute` interchangeably to mean a named column in a DataFrame.  We’ll also generally assume that `table`, `DataFrame`, and `relation` mean the same thing.

*Submission*      
See the external document for submission information.  Remember to also do **Homework 1, Part 2** and optionally **Homework 1-Advanced**.

*NBGrader Information*      
We're using a package called `nbgrader` to grade your assignments using an autograding system. With that, there's a couple things to take note:
- If we specify a format, please use it!
- Some cells will not be able to be edited - that is totally fine, we'll mark them
- You may add/remove cells, but if a cell is marked test cases, please don't change it...just add cells before/after it!

*Score Breakdown*
Homework 1 has two parts, Part 1 and Part 2, which are each worth 50 points. The Advanced assignment, when released, will be worth an additional portion (ex: Advanced assignments may be graded out of 120 or 125 instead of 100).
- Step 1: 21 pts
- Step 2: 29 pts
- Step 3: 0 pts (However, if this is done incorrectly, tests in Step 4 will fail!)
- Step 4: 30 pts
- Step 5: 20 pts

## Part 1: Data Extraction and Cleaning
We'll begin by importing the data and doing some basic information extraction and cleaning. This helps prepare our dataset for analysis later on, in Part 2: Data Wrangling and Analysis.

The data files, whose contents are described in the provided notebook _Dataset Descriptions_, are:

* `airports.dat.txt` - data on airports, in comma-separated values (CSVs) with no header row

* `airlines.dat.txt` - data on airlines, in CSV with no header row

* `routes.dat.txt` - data on flight routes, in CSV with no header row

* http://docs.google.com/uc?export=download&id=1PPtjGx8lr_cDUfVa3qwlk1W8yY6hY91n - remote file with data on actual flights, with performance info, with a header row

* `aircraft_incidents.htm` - webpage that lists commercial aircraft incidents by year

## Step 1: Importing CSV Data

The first task will be to import tabular data.  Before you get started, run the following...

In [3]:
# csv is a package for file reading/IO
import csv

# pandas is the data analysis library we'll use in this course
import pandas as pd

In [4]:
# This cell can ultimately be removed - it is just to let your notebook compile
# until you write your solution
airports_df = pd.DataFrame({})
airlines_df = pd.DataFrame({})
flights_df = pd.DataFrame({})
routes_df = pd.DataFrame({})

## 1.1 Importing Tabular Data

Fill in the Cells below to read the specified input files using Pandas’ `read_csv` function.  For the first 3 sources you’ll need to assign column names to the data, based on the **Dataset Descriptions** and some hints below.  

We use the variable names `airports_df`, `airlines_df`, `routes_df`, and `flights_df` to refer to the DataFrames below. The `_df` is because Python is dynamically typed, so it helps make code more clear when the type is apparent from the variable name.

For your variables and your column names, follow the Python convention that names are in lowercase and underscores are used as spaces. Specifically, when naming columns that are ***shared*** between datasets, use the format datasource_property (i.e. `airport_id`, `airport_name`, `airline_id`, etc.). Distinct columns do not need to be treated this way, similarly with columns that are okay to share with same name (use your data scientist thinking to figure out which these might be!)

Please keep `lat`, `lon` and `alt` as abbreviations, but note that under the Python naming conventions these are lowercase in our dataframe columns!

In [5]:
# TODO: Load airports.dat.txt into a dataframe called airports_df
# Read the above paragraph for namings!
# YOUR CODE HERE
airports_df = pd.read_csv("airports.dat.txt",header = None, names = ['airport_id','airport_name','airport_city','airport_country','airport_iata','airport_icao','lat','lon','alt','timezone','dst','tz'])
airports_df = pd.DataFrame(airports_df)

You should see info on your dataframe's schema if you run this cell...

In [6]:
airports_df.dtypes

airport_id           int64
airport_name        object
airport_city        object
airport_country     object
airport_iata        object
airport_icao        object
lat                float64
lon                float64
alt                  int64
timezone           float64
dst                 object
tz                  object
dtype: object

This is the first of many *test case* cells that will help you to (partly) validate that you're on the right path with your answers.  If this (or any of the other cells) fails, this is a clue that your output isn't what we expect.

We also have hidden test cells used to grade your homework, which are marked with:

`[CIS 545 Test Cases] (XXX pts)` and end with `print('[CIS 545 Test Cases] (XXX pts)')`

The test cells should be read-only, but you still should not attempt to edit any of these cells. Typically, our hidden cells are more restrictive in addition to being worth more points. The public test cells are meant just as a gentle guidance, and passing them doesn't mean your answer will receive full points! Being very thorough in your work will help the chances of that.

In [7]:
# [CIS 545 Test Cases] (0 pts)
# This is an example of a test cell! 
# Please don't edit it!

if (len(airports_df) < 8100 or len(airports_df) > 8150): 
    raise ValueError('Your DataFrame doesn''t have the expected number of rows')
    
if (len(airports_df.columns) < 11 or len(airports_df.columns) > 12): # 11 or 12 expected
    raise ValueError('Your DataFrame doesn''t have the expected number of columns')

try:
    if (airports_df['airport_id'].dtype != 'int64'):
        raise ValueError('Airport ID is wrong type, should be integer')
    if (airports_df['airport_name'].dtype != 'object'):
        raise ValueError('Airport name is wrong type, should be object (string)')
    pass

except KeyError:
    raise KeyError('You likely misspelled a column name or didn''t load the dataframe')
    pass


print('[CIS 545 Test Cases] (0 pts)')

[CIS 545 Test Cases] (0 pts)

In [8]:
# [CIS 545 Test Cases] (2 pts)
# Testing dtypes of your dataframe


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [9]:
# TODO: Load airlines.dat.txt into a dataframe called airlines_df
# Again, check Dataset Descriptions!
airlines_df = pd.read_csv("airlines.dat.txt",header = None, names = ['airline_id','airline_name','alias','airline_iata','airline_icao','callsign','airline_country',
                                                 'active'])

# YOUR CODE HERE

In [10]:
airlines_df.dtypes

airline_id          int64
airline_name       object
alias              object
airline_iata       object
airline_icao       object
callsign           object
airline_country    object
active             object
dtype: object

In [11]:
# [CIS 545 Test Cases] (0 pts)

if (len(airlines_df) < 6030 or len(airlines_df) > 6060):
    raise ValueError('Unexpected number of airlines rows')
    
if (len(airlines_df.columns) != 8):
    raise ValueError('Unexpected number of columns in airlines')


print('[CIS 545 Test Cases] (0 pts)')

[CIS 545 Test Cases] (0 pts)

In [12]:
# [CIS 545 Test Cases] (2 pts)


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

Now, let's do the same for `routes` - notice that we have source and destination ID and IATA/ICAO code. For `Source airport` please use `src_iata_icao` and for `Source airport ID` please use `source_id` - for the destinations, use `target` for both (`target_iata_icao` and `target_id`).

Note that `Codeshare` you should import as `code_share`

In [13]:
# TODO: Load routes.dat.txt into a dataframe called routes_df
# Same idea as before!
routes_df = pd.read_csv("routes.dat.txt",header = None, names = ['airline','airline_id','src_iata_icao','source_id',
                                               'target_iata_icao','target_id','code_share','stops','equipment'])
# YOUR CODE HERE

In [14]:
routes_df.dtypes

airline             object
airline_id          object
src_iata_icao       object
source_id           object
target_iata_icao    object
target_id           object
code_share          object
stops                int64
equipment           object
dtype: object

In [15]:
# [CIS 545 Test Cases] (0 pts)
# Basic routes_df tests

if (len(routes_df) < 67660 or len(routes_df) > 67700):
    raise ValueError('Unexpected number of routes')
    
if (len(routes_df.columns) != 9):
    raise ValueError('Unexpected number of route columns')

if ('source_id' not in routes_df.columns):
    raise KeyError('Missing expected source_id field from routes')

if ('target_iata_icao' not in routes_df.columns):
    raise KeyError('Missing expected target_iata_iaco field from routes')


print('[CIS 545 Test Cases] (0 pts)')

[CIS 545 Test Cases] (0 pts)

In [16]:
# [CIS 545 Test Cases] (2 pts)
# routes_df data tests


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

For the last dataframe, `flights_df`, you are importing from a CSV with a header.  For now, have Python use the header names already in the file. When calling read_csv, use the option use_cols to specify a list of columns to import.  Only include the following fields (these were named in the CSV file header from BTS, and thus don’t follow Python naming conventions): [`YEAR`,`MONTH`,`DAY_OF_MONTH`,`CARRIER`,`FL_NUM`,`ORIGIN`,`DEST`,`ARR_DELAY_NEW`,`CANCELLED`]

The data is at: https://docs.google.com/uc?export=download&id=1PPtjGx8lr_cDUfVa3qwlk1W8yY6hY91n

In [17]:
# TODO: Import https://docs.google.com/uc?export=download&id=1PPtjGx8lr_cDUfVa3qwlk1W8yY6hY91n into flights_df, but
# also restrict to the following columns: 'YEAR','MONTH','DAY_OF_MONTH','CARRIER',
# 'FL_NUM','ORIGIN','DEST','ARR_DELAY_NEW','CANCELLED'

import requests
from io import StringIO

remote = requests.get('https://docs.google.com/uc?export=download&id=1PPtjGx8lr_cDUfVa3qwlk1W8yY6hY91n').content

# You can read from the remote file via:
flights_df = pd.read_csv(StringIO(remote.decode('utf-8')), usecols = ['YEAR','MONTH','DAY_OF_MONTH',
                                    'CARRIER','FL_NUM','ORIGIN','DEST','ARR_DELAY_NEW','CANCELLED'])
#
# But you also need to use particular columns as per the HW spec

In [18]:
# [CIS 545 Test Cases] (1 pt)
# Basic checks on the size of flights - you should pass all these!

if (len(flights_df) != 570118):
    raise ValueError('Expected a different number of flights from' + str(len(flights_df)))
    
if (len(flights_df.columns) != 9):
    raise ValueError('Perhaps you forgot to remove a column? Number of columns isn''t as expected, at ' + str(len(flights_df.columns)))
        
print('[CIS 545 Test Cases] (1 pt)')

[CIS 545 Test Cases] (1 pt)

In [19]:
# [CIS 545 Test Cases] (2 pts)


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

## Notes on the data so far

The data you've imported isn't yet perfect....

**Nulls**.  You should see for airlines a variety of entries that say “NaN” (not a number), which represents “unknown” or null information.  In fact, if you look closely there are also other values representing “unknown” such as “\N” and even “-”.  We’ll have to regularize all of this later!

**Schemas**.  OK, you’ve loaded the DataFrames.  You can get the schemas -- the names and types of the columns -- of the DataFrames by the `dtypes` property.  Use `airlines_df.dtypes` and `routes_df.dtypes` to take a look at the schemas.  Now compare the types of `routes_df.airline_id` and `airlines_df.airline_id`.  You should see that one is `int64` and the other is `object`.

Why is this?  Python automatically infers the types based on what it reads from the CSV files.  Unfortunately, things like “NaN” are actually floating-point (fractional) numbers and “\N” is a string.  If a column has multiple kinds of values, Python will consider it to be an “object.”  Unfortunately, this will interfere with how we combine tables later, so we need to “clean” the data.  

We'll come back to this later in Homework 1, Part I.  Before that we'll let you take a look at the data to see the issues, and then we'll import even more data (text data this time!).

In [20]:
# YOUR CODE HERE
airlines_df.dtypes

airline_id          int64
airline_name       object
alias              object
airline_iata       object
airline_icao       object
callsign           object
airline_country    object
active             object
dtype: object

In [21]:
routes_df.dtypes

airline             object
airline_id          object
src_iata_icao       object
source_id           object
target_iata_icao    object
target_id           object
code_share          object
stops                int64
equipment           object
dtype: object

## 1.1 Final Results
Just run these cells! We've made them read-only and they're not graded.

In [22]:
# Output airports_df
airports_df.head(10)

,airport_id,airport_name,airport_city,airport_country,airport_iata,airport_icao,lat,lon,alt,timezone,dst,tz
0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10.0,U,Pacific/Port_Moresby
1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.788700,20,10.0,U,Pacific/Port_Moresby
2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10.0,U,Pacific/Port_Moresby
3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10.0,U,Pacific/Port_Moresby
4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.220050,146,10.0,U,Pacific/Port_Moresby
5,6,Wewak Intl,Wewak,Papua New Guinea,WWK,AYWK,-3.583828,143.669186,19,10.0,U,Pacific/Port_Moresby
6,7,Narsarsuaq,Narssarssuaq,Greenland,UAK,BGBW,61.160517,-45.425978,112,-3.0,E,America/Godthab
7,8,Nuuk,Godthaab,Greenland,GOH,BGGH,64.190922,-51.678064,283,-3.0,E,America/Godthab
8,9,Sondre Stromfjord,Sondrestrom,Greenland,SFJ,BGSF,67.016969,-50.689325,165,-3.0,E,America/Godthab
9,10,Thule Air Base,Thule,Greenland,THU,BGTL,76.531203,-68.703161,251,-4.0,E,America/Thule

In [23]:
# Output airlines_df
airlines_df.head(10)

,airline_id,airline_name,alias,airline_iata,airline_icao,callsign,airline_country,active
0,1,Private flight,\N,-,NaN,NaN,NaN,Y
1,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N
4,5,213 Flight Unit,\N,NaN,TFU,NaN,Russia,N
5,6,223 Flight Unit State Airline,\N,NaN,CHD,CHKALOVSK-AVIA,Russia,N
6,7,224th Flight Unit,\N,NaN,TTF,CARGO UNIT,Russia,N
7,8,247 Jet Ltd,\N,NaN,TWF,CLOUD RUNNER,United Kingdom,N
8,9,3D Aviation,\N,NaN,SEC,SECUREX,United States,N
9,10,40-Mile Air,\N,Q5,MLA,MILE-AIR,United States,Y

In [24]:
# Output routes_df
routes_df.head(10)

,airline,airline_id,src_iata_icao,source_id,target_iata_icao,target_id,code_share,stops,equipment
0,2B,410,AER,2965,KZN,2990,NaN,0,CR2
1,2B,410,ASF,2966,KZN,2990,NaN,0,CR2
2,2B,410,ASF,2966,MRV,2962,NaN,0,CR2
3,2B,410,CEK,2968,KZN,2990,NaN,0,CR2
4,2B,410,CEK,2968,OVB,4078,NaN,0,CR2
5,2B,410,DME,4029,KZN,2990,NaN,0,CR2
6,2B,410,DME,4029,NBC,6969,NaN,0,CR2
7,2B,410,DME,4029,TGK,\N,NaN,0,CR2
8,2B,410,DME,4029,UUA,6160,NaN,0,CR2
9,2B,410,EGO,6156,KGD,2952,NaN,0,CR2

In [25]:
# Output flights_df
flights_df.head(10)

,YEAR,MONTH,DAY_OF_MONTH,CARRIER,FL_NUM,ORIGIN,DEST,ARR_DELAY_NEW,CANCELLED
0,2018,1,2,WN,1325,SJU,MCO,0.0,0.0
1,2018,1,2,WN,5159,SJU,MCO,0.0,0.0
2,2018,1,2,WN,5890,SJU,MCO,9.0,0.0
3,2018,1,2,WN,6618,SJU,MCO,0.0,0.0
4,2018,1,2,WN,1701,SJU,MDW,8.0,0.0
5,2018,1,2,WN,844,SJU,TPA,23.0,0.0
6,2018,1,2,WN,4679,SJU,TPA,0.0,0.0
7,2018,1,2,WN,6294,SLC,BUR,20.0,0.0
8,2018,1,2,WN,5245,SLC,DAL,0.0,0.0
9,2018,1,2,WN,2278,SLC,DEN,0.0,0.0

In [26]:
routes_df[312:400][:]

,airline,airline_id,src_iata_icao,source_id,target_iata_icao,target_id,code_share,stops,equipment
312,3H,\N,AKV,5506,YIK,5504,NaN,0,DH8
313,3H,\N,AKV,5506,YPX,6727,NaN,0,DH8
314,3H,\N,XGR,5512,YVP,154,NaN,0,DHT BET
315,3H,\N,YGL,62,YGW,5496,NaN,0,DHT
316,3H,\N,YGL,62,YPX,6727,NaN,0,73M
317,3H,\N,YGL,62,YUL,146,NaN,0,73M
318,3H,\N,YGW,5496,YGL,62,NaN,0,DHT
319,3H,\N,YGW,5496,YPH,5520,NaN,0,BET
320,3H,\N,YGW,5496,YSK,5529,NaN,0,DH8
321,3H,\N,YGW,5496,YUD,5515,NaN,0,DH8
322,3H,\N,YGW,5496,YUL,146,NaN,0,DH8
323,3H,\N,YGW,5496,YUY,149,NaN,0,DH8
324,3H,\N,YIK,5504,AKV,5506,NaN,0,DH8
325,3H,\N,YIK,5504,YZG,5535,NaN,0,DH8
326,3H,\N,YKG,5481,YPJ,5508,NaN,0,DHT DH8
327,3H,\N,YKG,5481,YQC,5499,NaN,0,DH8
328,3H,\N,YKG,5481,YVP,154,NaN,0,DH8 DHT
329,3H,\N,YKL,80,YQB,111,NaN,0,DH8
330,3H,\N,YKL,80,YVP,154,NaN,0,DH8 BET
331,3H,\N,YKL,80,YWK,161,NaN,0,BET
332,3H,\N,YKL,80,YZV,202,NaN,0,BET DH8
333,3H,\N,YPH,5520,YPX,6727,NaN,0,DH8 BET
334,3H,\N,YPH,5520,YUD,5515,NaN,0,DH8
335,3H,\N,YPH,5520,YVP,154,NaN,0,BET
336,3H,\N,YPJ,5508,YKG,5481,NaN,0,DHT DH8
337,3H,\N,YPJ,5508,YTQ,6728,NaN,0,DHT DH8
338,3H,\N,YPJ,5508,YVP,154,NaN,0,DHT
339,3H,\N,YPX,6727,AKV,5506,NaN,0,DH8
340,3H,\N,YPX,6727,YGL,62,NaN,0,73M
341,3H,\N,YPX,6727,YPH,5520,NaN,0,DH8
...,...,...,...,...,...,...,...,...,...
370,3H,\N,YWK,161,YKL,80,NaN,0,BET
371,3H,\N,YWK,161,YZV,202,NaN,0,BET
372,3H,\N,YZG,5535,YIK,5504,NaN,0,DH8
373,3H,\N,YZG,5535,YWB,7253,NaN,0,DH8
374,3H,\N,YZV,202,YKL,80,NaN,0,BET DH8
375,3H,\N,YZV,202,YWK,161,NaN,0,BET
376,3J,5521,JIB,4119,DXB,2188,NaN,0,737
377,3J,5521,JIB,4119,JED,2072,NaN,0,737
378,3J,5521,JIB,4119,MGQ,5687,NaN,0,737
379,3J,5521,MGQ,5687,NBO,4059,NaN,0,737
380,3J,5521,NBO,4059,MGQ,5687,NaN,0,737
381,3K,3021,BKK,3885,SIN,3316,NaN,0,320
382,3K,3021,DRW,3999,SIN,3316,NaN,0,320
383,3K,3021,HAK,4120,SIN,3316,NaN,0,320
384,3K,3021,HGH,3386,SIN,3316,NaN,0,320
385,3K,3021,HKG,3077,SIN,3316,NaN,0,320
386,3K,3021,HKT,3179,SIN,3316,NaN,0,320
387,3K,3021,KIX,3992,MNL,2397,NaN,0,320
388,3K,3021,KIX,3992,TPE,2276,NaN,0,320
389,3K,3021,KUL,3304,SIN,3316,NaN,0,320
390,3K,3021,MNL,2397,KIX,3992,NaN,0,320
391,3K,3021,MNL,2397,SIN,3316,NaN,0,320
392,3K,3021,PEN,3308,SIN,3316,NaN,0,320
393,3K,3021,PER,3351,SIN,3316,NaN,0,320
394,3K,3021,PNH,3034,SIN,3316,NaN,0,320
395,3K,3021,REP,3035,SIN,3316,NaN,0,320
396,3K,3021,RGN,3239,SIN,3316,NaN,0,320
397,3K,3021,SGN,3205,SIN,3316,NaN,0,320
398,3K,3021,SIN,3316,BKK,3885,NaN,0,320
399,3K,3021,SIN,3316,DRW,3999,NaN,0,320

## 1.2 Importing Text Data

We are going to scrape data from the aircraft_incidents.htm webpage using the *beautifulsoup4* package. More details can be found in the documentation: https://www.crummy.com/software/BeautifulSoup/bs4/doc/.

Run the code snippet that stores the web content in soup. Once the content is extracted, we need to get rid of the HTML tags and select the data we are going to be looking at. The data we need are the year and the description of the incidents under that year. It can be seen that the HTML tag (almost always) for the year is `<h3>` and for the incidents it is `<li>`.

In [27]:
# bs4 is one of the packages frequently used for HTML parsing!
# Just run this cell, but reading the bs4 docs will help later...

from bs4 import BeautifulSoup
input_html = "aircraft_incidents.htm"

# Open file I/O
with open(input_html, "r") as ifile:
    # soup is the bs4 object 
    soup = BeautifulSoup(ifile, 'html.parser')

Using beautifulsoup4’s `find_all`(list of tags) function, only select the content under those HTML tags. Store the data in a list of strings called `selected_data`, where each year or incident description is a separate string in the list.

In [28]:
# TODO: Select Year and Incident description. It can be seen that they are usually
# <h3> or <li> tags.

# Assign the results to variable selected_data. 
selected_data = [] # Fill this in with your code after!

for item in soup.find_all(['h3', 'li']):
    selected_data.append(item.get_text())

In [29]:
# [CIS 545 Test Cases] (1 pt)
# Basic checks on selected_data

if (not type(selected_data) is list):
    raise ValueError('''For efficiency, please 
    store selected_data as list''')
    
if (len(selected_data) < 1570 or len(selected_data) > 1585):
    raise ValueError("Don't have the expected number of entries")
    

print('[CIS 545 Test Cases] (1 pt)')

[CIS 545 Test Cases] (1 pt)

In [30]:
# [CIS 545 Test Cases] (2 pts)
# Checking selected_data more rigorously


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [31]:
# [CIS 545 Test Cases] (2 pts)
# Checking selected_data more rigorously


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

Finally, check if all the HTML tags have been removed. Output the message 'No Tag Found!’, if successful.

In [32]:
# TODO: Check if all tags have been removed
# Output 'No Tag Found!' if no tags

# YOUR CODE HERE
if ~ ( '<' in selected_data and '>' in selected_data):
    print ('No Tag Found!')

No Tag Found!

In [33]:
# [CIS 545 Test Cases] (2 pts)
# Checking HTML cleaning


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [34]:
# View a slice of selected_data
selected_data[:15]

['1919[edit]',
 'July 21 – The Goodyear dirigible Wingfoot Air Express catches fire and crashes into the Illinois Trust and Savings Building in Chicago, Illinois, while carrying passengers to a local amusement park, killing thirteen people: three out of the five on board and ten others on the ground, with 27 others on the ground being injured.',
 'August 2 – A Caproni Ca.48 crashes at Verona, Italy, during a flight from Venice to Taliedo, Milan, killing all on board (14, 15, or 17 people, according to different sources).',
 '1920[edit]',
 'December 14 – A Handley Page Transport Handley Page O/400 hits a tree and crashes at Golders Green, London, after failing to gain height following takeoff, killing four out of eight on board.',
 '1922[edit]',
 'April 7 – In the first mid-air collision of airliners, a de Havilland DH.18A, G-EAWO, operated by Daimler Hire Ltd., collides with a Farman F.60 Goliath, F-GEAD, operated by Compagnie des Grands Express Aériens (CGEA), over the Thieulloy-St. Antoine road near Picardie, France, killing all seven people on both aircraft.',
 '1923[edit]',
 'May 14 – An Air Union Farman F.60 Goliath crashes near Monsures, Somme, France, due to the structural failure of a wing, killing all six on board.',
 'August 27 – An Air Union Farman F.60 Goliath crashes near East Malling, Kent, England, due to engine failure, and confusion among the passengers, killing one of 13 on board.',
 'September 14 – A Daimler Airway de Havilland DH.34 crashes at Ivinghoe, Buckinghamshire, England, after stalling while attempting an emergency landing, killing all five on board.',
 '1924[edit]',
 'December 24 – An Imperial Airways de Havilland DH.34 crashes near Purley, Surrey, England, due to a stall during an attempted emergency landing in response to an unknown mechanical defect, killing all eight on board.',
 '1926[edit]',
 'August 18 – An Air Union Blériot 155 crashes while attempting an emergency landing at College Farm, Hurst, Aldington, England, due to engine failure, killing three of 15 on board; the pilot initially survives, but dies a day later.']

Now we'd like you to save the results to a file called `incidents_raw.txt`.  You can use the file commands: `open`, `write`, and `close`.  Be sure to write a newline (`\n`) after each line, so that later you can read the lines back.

In [35]:
# TODO: Write selected_data to incidents_raw.txt

file = open("incidents_raw.txt",'w')
for line in selected_data:
    file.write(line +'\n')
file.close()

In [36]:
# [CIS 545 Test Cases] (5 pts)
# Checking incidents_raw processing - this is worth a lot!


print('[CIS 545 Test Cases] (5 pts)')

[CIS 545 Test Cases] (5 pts)

## Step 2: Simple Data Cleaning

Now we need to do some further cleaning to both the CSV and text data.

(use Insert|Insert Cell Above or Insert Cell Below as needed to add further cells)

## 2.1 Cleaning Tabular Data
We are going to clean the `airlines_df`, `airports_df`, and `routes_df` DataFrames.  First, run a "helper" function we've defined for you.

In [37]:
# Replace NaNs with blanks if the column is a string
# Everything should be of a consistent type
def fillna_col(series):
    if series.dtype is pd.np.dtype(object):
        return series.fillna('')
    else:
        return series

Additionally, define a second function called `nullify` that takes a single parameter `x`. Given the parameter value `\N` it returns `NaN`, otherwise it returns the value of the parameter.

In [38]:
# TODO: Define nullify here

def nullify(x):
    if x == r'\N':
        return float('nan')
    else:
        return x

In [39]:
# [CIS 545 Test Cases] (2 pts)
# Checking nullify

# Test that nullify on 'abc' just returns the value
if (nullify('abc') != 'abc'):
    raise ValueError("Nullify doesn't seem to work!\n")

# Ditto for an integer
if (nullify(3) != 3):
    raise ValueError("Nullify doesn't seem to work!\n")
    
print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [40]:
# [CIS 545 Test Cases] (3 pts)
# Checking nullify


print('[CIS 545 Test Cases] (3 pts)')

[CIS 545 Test Cases] (3 pts)

### 2.1.1 Regularizing and removing nulls

Next, we’ll need to use two functions to apply `nullify` and `fillna_col` to our DataFrames.  

The DataFrame applymap function can be used to apply a function to every cell of a DataFrame.  We can use this to apply nullify to all of the elements in each of our DataFrames (airports, airlines, etc.) and get rid of all of the “\N”s.

The DataFrame `apply` function can be used to apply a function to every column of a DataFrame.  Let’s use that to call `fillna_col `on the DataFrames -- replacing the NaNs with blank strings if the column is otherwise an object.

Also, let’s get rid of rows in `routes_df` that have null airline, source, or destination IDs.  Recall that `dropna` can be used here.

You’ll want to update your DataFrames using all of the above functions.  Think carefully about the order in which to apply these.

In [41]:
airlines_df = airlines_df.applymap(nullify)
airports_df = airports_df.applymap(nullify)
routes_df = routes_df.applymap(nullify)
airlines_df = airlines_df.apply(fillna_col)
airports_df = airports_df.apply(fillna_col)
routes_df = routes_df.dropna(subset = ['airline_id', 'source_id', 'target_id'])
routes_df = routes_df.apply(fillna_col)

In [42]:
# [CIS 545 Test Cases] (1 pt)
# Basic checks of your dataframes

if airports_df.isnull().sum().sum() != 0:
    raise ValueError('airports_df still has NaNs')
    
if airlines_df.isnull().sum().sum() != 0:
    raise ValueError('airlines_df still has Nans')
    
if routes_df.isnull().sum().sum() != 0:
    raise ValueError('routes_df still has Nans')
    
print('[CIS 545 Test Cases] (1 pt)')

[CIS 545 Test Cases] (1 pt)

In [43]:
## [CIS 545 Test Cases] (2 pts)
# Checking your data cleaning


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [44]:
# [CIS 545 Test Cases] (2 pts)
# Checking your data cleaning


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

### 2.1.2 Changing column types

After all of this, `routes_df.airline_id` will only have integers, but will still have its existing type of object.  Later we’ll need it to be an integer, so that it can be compared directly with the entries from `airlines_df` and `airports_df`.  Let’s convert it to integer via:

```
routes_df['airline_id'] = routes_df['airline_id'].astype(int)
```

Repeat the same process for the source and destination airport IDs.

In [45]:
# TODO: Change column types according to Step 2
#print(routes_df['airline_id'][0:15])
routes_df['airline_id'] = routes_df['airline_id'].astype(int)
routes_df['source_id'] = routes_df['source_id'].astype(int)
routes_df['target_id'] = routes_df['target_id'].astype(int)

In [46]:
# [CIS 545 Test Cases] (2 pts)


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

## 2.2 Cleaning the Text Data

We will clean the raw text data we stored in `incidents_raw.txt`. For each incident, we want it in the form:

```
1997 January 9 , Comair Flight 3272, an Embraer EMB 120 Brasília, crashes near Ida, Michigan, during a snowstorm, killing all 29 on board.
```

Points to follow during cleaning:

* Remove `[edit]` from the year

* Only select incidents that have occured in the year >= 1997

* Since we extracted the data using tags `<h3>` and `<li>`, it is possible that there was other data extracted too. See the end of file `incidents_raw.txt`. However, if we look at the format of all the incidents, we can see that they all contain: *month*, the word `Flight` and the symbol `–`. Use these conditions to filter out unwanted data.

* Store all the cleaned incidents in a list named `clean_incidents`.

In [47]:
# TODO: Read and clean raw text file and store in clean_incidents

clean_incidents = []

with open ("incidents_raw.txt", "r") as text:
    while True:
        line = text.readline()
        if line:
            clean_incidents.append(line.strip("[edit]\n"))  
        else:
            break
clean_incidents = clean_incidents[clean_incidents.index('1997') : ]
new_incidents = []
years = range(1997, 2019)
str_years=''.join([str(a) for a in years])
for item in clean_incidents:
    if item in str_years:
        year = item
    if 'Flight' in item and (item!=''):
        item = item.replace('–',',')
        new_incidents.append(year +' '+ item)
clean_incidents = new_incidents
print(clean_incidents)
print(len(clean_incidents))

['1997 January 9 , Comair Flight 3272, an Embraer EMB 120 Brasília, crashes near Ida, Michigan, during a snowstorm, killing all 29 on board.', '1997 March 18 , Stavropolskaya Aktsionernaya Avia Flight 1023, an Antonov An-24, breaks up in flight and crashes near Cherkessk, Russia; all 50 on board die.', '1997 April 19 , Merpati Nusantara Airlines Flight 106, a BAe ATP crashes during a failed go-around in bad weather at Buluh Tumbang International Airport, Indonesia. 15 of the 53 passengers and crew are killed.', '1997 May 8 , China Southern Airlines Flight 3456, a Boeing 737, makes a hard landing in Shenzhen, China, during poor weather and crashes, killing 35 of the 74 people on board.', '1997 July 31 , FedEx Express Flight 14, a McDonnell Douglas MD-11, crashes upon landing at Newark Liberty International Airport; the two crew members and three passengers escape uninjured.', '1997 July 17 , Sempati Air Flight 304, a Fokker F27, crashes shortly after take off from Husein Sastranegara International Airport. 28 people were killed.', '1997 August 6 , Korean Air Flight 801, a Boeing 747, crashes while attempting to land in heavy rain at Guam International Airport; of the 254 people on board, only 26 survive.', '1997 August 10 , Formosa Airlines Flight 7601, a Dornier Do 228, crashes while attempting to land at Beigan, Lienchiang, in the Matsu Islands. All 16 passengers and crew on board are killed.', '1997 September 3 , Vietnam Airlines Flight 815, a Tupolev Tu-134, crashes on approach to Phnom Penh International Airport in heavy rain, killing 64 of the 66 people on board.', '1997 September 6 , Royal Brunei Airlines Flight 238, a Dornier Do 228, crashes into a hill side in Lambir Hills National Park, killing all 10 on board.', '1997 September 26 , Garuda Indonesia Flight 152, an Airbus A300, crashes into a mountain near Buah Nabar, Indonesia, killing all 234 on board.', '1997 October 10 , Austral Líneas Aéreas Flight 2553, a McDonnell Douglas DC-9, crashes near Fray Bentos, Uruguay, traveling from Posadas to Buenos Aires, resulting in the death of all 74 occupants.', '1997 December 15 , Tajikistan Airlines Flight 3183, a Tupolev Tu-154, crashes into the desert near Sharjah Airport, of the 86 on board, only the flight engineer survives.', '1997 December 17 , Aerosvit Flight 241, a Yakovlev Yak-42, crashes near Thessaloniki, Greece, killing all 70 people on board.', '1997 December 19 , SilkAir Flight 185, a Boeing 737, crashes into the Musi River near Palembang, Indonesia, killing all 102 people on board.', '1997 December 28 , United Airlines Flight 826, a Boeing 747, encounters severe turbulence two hours into the flight; the aircraft safely lands back in Tokyo; all survive the accident, but a passenger dies later; despite having no damage, the aircraft is written off.', '1998 February 2 , Cebu Pacific Flight 387, a McDonnell Douglas DC-9, crashes into a mountain near Mount Sumagaya in Misamis Oriental in the Philippines, killing all 104 passengers and crew members on board.', '1998 February 16 , China Airlines Flight 676, an Airbus A300, crashes into a residential area while attempting to land in Taipei, Taiwan. All 196 people on board are killed, in addition to six on the ground.', '1998 March 22 , Philippine Airlines Flight 137, an Airbus A320, overshoots the end of the runway while landing at Bacolod City in the Philippines, plowing through several houses. None of the passengers was harmed, but three people on the ground are killed and several more injured.', '1998 April 20 , Air France Flight 422, a Boeing 727 leased from TAME Airlines, crashes into the mountains east of Bogotá, Colombia, on takeoff from El Dorado International Airport of Bogotá in foggy weather. All 53 passengers and crew perish.', '1998 May 25 , PIA Flight 544, a Fokker F-27, is hijacked shortly after takeoff by three armed men. F-16 fighter jets intercept the plane and force it to land. The hijackers are arrested and sentenced to death. All 38 on board survive.', '1998 June 18 , Propair Flight 420, a Fairchild Metroliner crashes shortly after takeoff from Dorval Airport (now Montréal,Pierre Elliott Trudeau International Airport), Canada following an inflight fire. All 11 passengers and crew are killed.', '1998 July 30 , Proteus Airlines Flight 706: a Beechcraft 1900D collides in mid-air with a light aircraft over Quiberon Bay. Both aircraft crash into the sea, killing 15 people.', '1998 August 24 , Myanma Airways Flight 635, a Fokker F-27 Friendship, crashes while on approach to Tachilek Airport; all 36 on board die.', "1998 August 29 , Cubana de Aviación Flight 389, a Tupolev Tu-154M overruns the runway whilst taking off from Quito's Mariscal Sucre International Airport, Ecuador, proceeding to crash into a soccer field. 70 of the 91 passengers and crew are killed, along with 10 on the ground.", '1998 September 2 , Swissair Flight 111, a McDonnell Douglas MD-11, crashes into the sea near Halifax, Nova Scotia in Canada, because of an onboard fire. All 229 people on board perish.', '1998 September 25 , PauknAir Flight 4101, a BAe 146, leaves Málaga but never reaches its destination in Melilla. All passengers and crew perish.', '1998 September 29 , Lionair Flight 602, an Antonov An-24, is shot down by the Liberation Tigers of Tamil Eelam and crashes off the coast of Jaffna, Sri Lanka, killing all 55 on board.', '1998 December 11 , Thai Airways International Flight 261, an Airbus A310, crashes during poor weather near Surat Thani, Thailand. Of the 146 people on board, 102 are killed.', '1999 February 24 , China Southwest Airlines Flight 4509, a Tupolev Tu-154, crashes while on approach to Wenzhou Airport, killing all 61 passengers and crew on board.', '1999 April 7 , Turkish Airlines Flight 5904, a Boeing 737-400, crashes in poor weather near Hamdilli, Ceyhan, Turkey; all six crew die.', '1999 April 15 , Korean Air Cargo Flight 6316, a McDonnell Douglas MD-11F crashes shortly after takeoff from Shanghai Hongqiao Airport, China. All three crew members, as well as five on the ground, are killed.', '1999 June 1 , American Airlines Flight 1420, a McDonnell Douglas MD-82 with 139 passengers on board, skids off the runway on landing and crashes into a steel walkway at Little Rock, Arkansas during strong winds; 11 are killed, and 86 are injured.', '1999 July 24 , Air Fiji Flight 121, an Embraer EMB 110 Bandeirante crashes into a mountain en route to Nadi International Airport, Fiji. All 17 passengers and crew are killed.', '1999 July 24 , All Nippon Airways Flight 61, a Boeing 747, is hijacked by a passenger, Yuji Nishizawa, wielding a knife; after fatally stabbing the captain, he is overpowered by the crew; the first officer lands the plane safely at Haneda, Japan.', '1999 August 7 , TACV Flight 5002, a Dornier Do 228 crashes into a mountain whilst returning to São Pedro Airport, Cape Verde in poor weather. All 18 passengers and crew are killed.', '1999 August 22 , China Airlines Flight 642, a McDonnell Douglas MD-11, crashes on landing at Hong Kong International Airport during "Typhoon" Sam; of the 315 people on board, three die.', '1999 August 31 , LAPA Flight 3142, a Boeing 737, overshoots the runway in Buenos Aires, Argentina, and crashes into a golf course; of the 103 people on board, 63 are killed, as well as two on the ground.', '1999 September 5 , Necon Air Flight 128, a BAe 748 collides with a telecommunications tower whilst on approach into Kathmandu Airport, Nepal. All 15 passengers and crew are killed.', '1999 September 14 , Britannia Airways Flight 226A, a Boeing 757, veers off the runway at Girona, Catalonia Spain, while landing in a thunderstorm and comes to rest in a field, broken apart in two places; 43 on board are injured, two seriously, but a passenger initially diagnosed as "lightly injured" dies five days later of unnoticed internal injuries.', '1999 September 23 , Qantas Flight 1, a Boeing 747 runs off the runway due to a storm and comes to a complete stop just short of a golf course. All on board including 30 injured passengers survive.', '1999 October 31 , EgyptAir Flight 990, a Boeing 767 bound for Cairo, Egypt, crashes into the Atlantic Ocean off Nantucket, Massachusetts, killing all 217 passengers and crew; cause is disputed: a deliberate suicide/homicide act by the relief first officer according to the NTSB, vs. a Boeing mechanical flaw according to Egyptian aviation authorities.', '1999 November 9 , TAESA Flight 725, a McDonnell Douglas DC-9, crashes near Uruapan, Mexico, killing all 18 on board.', '1999 November 12 , Si Fly Flight 3275, an ATR 42-300 operating a UN relief flight strikes a mountain in poor weather whilst on approach into Pristina Airport, Kosovo. All 24 passengers and crew are killed.', '1999 December 7 , Asian Spirit Flight 100, a Let L-410 Turbolet, crashes into a mountain while on approach to Cauayan Airport, killing all 15 passengers and crew on board.', '1999 December 11 , SATA Air Açores Flight 530M, a BAe ATP crashes into a mountain whilst on approach into Flores Airport in the Azores. All 35 passengers and crew are killed.', '1999 December 21 , Cubana de Aviación Flight 1216, a McDonnell Douglas DC-10, overruns the runway at La Aurora International Airport, killing 16 of 314 people on board and another two on the ground.', '1999 December 22 , Korean Air Cargo Flight 8509, a Boeing 747-200F, crashes after takeoff near Great Hallingbury, England; killing all four crew.', '1999 December 24 , Indian Airlines Flight 814, an Airbus A300, is hijacked en route to Delhi, India; one hostage is killed.', '1999 December 25 , Cubana de Aviación Flight 310, a Yakovlev Yak-42D, crashes into the San Luis Hill near Bejuma, Venezuela, while on approach to Arturo Michelena International Airport; all 22 on board die.', '2000 January 10 , Crossair Flight 498, a Saab 340, crashes two minutes after takeoff in Niederhasli, Switzerland, killing all 10 people on board.', "2000 January 30 , Kenya Airways Flight 431, an Airbus A310, carrying 169 passengers and 10 crew members, crashes into the Atlantic Ocean off Côte d'Ivoire after takeoff from Abidjan. Only 10 people survive.", '2000 January 31 , Alaska Airlines Flight 261, an MD-83, crashes into the Pacific Ocean off Point Mugu, California, after problems with its horizontal stabilizer. All 83 passengers and five crew members are killed.', '2000 February 16 , Emery Worldwide Flight 17, a DC-8-71F crashes into a salvage yard shortly after takeoff from Sacramento Mather Airport, California. All three crew members are killed.', '2000 March 5 , Southwest Airlines Flight 1455, a Boeing 737-300, overruns the runway in Burbank, California. Of the 142 people on board, 43 are injured, two seriously.', '2000 April 19 , Air Philippines Flight 541, a Boeing 737-200, crashes in a coconut plantation on Samal Island, Davao del Norte while preparing to approach the Davao International Airport, killing all 131 people on board in the worst ever accident involving the 737-200.', '2000 June 22 , Wuhan Airlines Flight 343, a Xian Y-7, is struck by lightning and crashes in Hanyang District, Wuhan, killing all 42 on board and another seven on the ground in the worst ever accident involving the Y-7.', '2000 July 4 , Malév Flight 262, a Tupolev Tu-154, lands on its belly at Thessaloniki International Airport in Greece. There are no serious injuries or fatalities.', '2000 July 8 , Aerocaribe Flight 7831, a British Aerospace Jetstream 32, crashes near Chulum Juárez, Mexico, killing all 19 on board.', '2000 July 12 , Hapag-Lloyd Flight 3378, an Airbus A310, crash-lands 650 metres short of the runway in Vienna after running out of fuel in flight. There are no serious injuries or fatalities.', '2000 July 17 , Alliance Air Flight 7412, a Boeing 737-200, crashes into government housing in Patna, India, as it approaches the airport, killing 55 of the 58 on board and five people on the ground.', '2000 July 25 , Air France Flight 4590, a Concorde crashes during takeoff from Paris, France, after striking debris on the runway, killing all 100 passengers and nine crew aboard as well as four on the ground; the entire Concorde fleet is grounded for one year.', '2000 August 23 , Gulf Air Flight 072, an Airbus A320, crashes into the Persian Gulf off Manama, Bahrain, while attempting to land. All 135 passengers and eight crew members are killed.', '2000 October 31 , Singapore Airlines Flight 006, a Boeing 747-400, strikes construction equipment after using a closed runway for takeoff at Chiang Kai-shek International Airport, Taiwan, killing 83 out of 179 people on board.', '2000 November 18 , Dirgantara Air Service Flight 3130, a Britten Norman Islander BN-2 crashes shortly after take off from Datah Dawai Airport in East Kalimantan, Indonesia. No one is killed, but all on board were injured, 11 seriously.', '2000 December 20 , British Airways Flight 2069, in Sudanese airspace at 35,000\xa0ft, a hijacker storms the cabin in an attempt to send the plane into a nosedive. However, Captain William Hagan and First Officer Richard Webb help subdue the mentally ill hijacker, while First Officer Phil Watson levels the flight. None of the 398 on board is seriously injured.', "2001 January 23 , Yemenia Flight 448, a Boeing 727, is hijacked 15 minutes after takeoff from Sana'a International Airport, Yemen; the crew makes an emergency landing at Djibouti; the hijacker is subdued with no casualties to the 101 on board.", '2001 January 25 , RUTACA Airlines Flight 225, a Douglas DC-3 crashes shortly after takeoff from Tomás de Heres Airport, Venezuela as a result of an engine failure. All 24 passengers and crew were killed.', '2001 January 31 , In the 2001 Japan Airlines mid-air incident, Japan Airlines Flight 907, a Douglas DC-10, and Japan Airlines Flight 958, a Boeing 747, narrowly avoid colliding by a margin of 36 feet (11 meters) near Yaizu, Japan.', '2001 February 27 , Loganair Flight 670A, a Short 360 operating a postal flight crashes shortly after takeoff from Edinburgh Airport, Scotland as a result of a double engine failure. Both crew members are killed.', '2001 March 3 , Thai Airways International Flight 114, a Boeing 737-400 is destroyed by an explosion while on the tarmac at Don Mueang Airport, Thailand. One flight attendant is killed in the explosion, which happened prior to boarding.', '2001 March 24 , Air Caraïbes Flight 1501, a DHC-6 Twin Otter crashes into a house whilst on approach into Saint Barthélemy Airport, Guadeloupe. All 19 passengers and crew, as well as one person on the ground, are killed.', '2001 July 4 , Vladivostok Air Flight 352, a Tupolev Tu-154 enters a flat spin on approach to Irkutsk Airport in Irkutsk, Russia, crashes down onto its belly and bursts into flames in a wooded area, killing all 145 aboard.', '2001 August 24 , Air Transat Flight 236, an Airbus A330, runs out of fuel over the Atlantic Ocean and makes an emergency landing in the Azores. Upon landing some of the tires blow out, causing a fire that is extinguished by emergency personnel on the ground. None of the 304 people on board the aircraft is seriously injured.', '2001 August 29 , Binter Mediterráneo Flight 8261, a CASA CN-235, suffers port engine failure and crashes onto the N-340 road while attempting to make an emergency landing at Ruiz Picasso International Airport, killing four of 43 on board; the pilot initially survives, but dies several hours later.', ' September 11 , American Airlines Flight 11, a Boeing 767-200ER with 92 people on board, is hijacked after taking off from Boston, and is flown into the north tower of the World Trade Center in New York City; all on board are killed as well as around 1600 people on the ground and in the building; the collapse of both towers brings the total death toll from the two crashes to at least 2,763, the worst disaster involving commercial aircraft.', ' September 11 , United Airlines Flight 175, a Boeing 767-200 with 65 people on board, is hijacked after taking off from Boston and is flown into the south tower of the World Trade Center in New York City; all on board are killed as well as around 900 people on the ground and in the building; the collapse of both towers brings the total death toll from the two crashes to at least 2,763, the worst disaster involving commercial aircraft.', ' September 11 , American Airlines Flight 77, a Boeing 757-200 with 64 people on board, is hijacked after taking off from Dulles International Airport and is flown into The Pentagon; all on board are killed as well as 125 people in the building and on the ground.', ' September 11 , United Airlines Flight 93, a Boeing 757-200 with 44 people on board, is hijacked after taking off from Newark, New Jersey; passengers struggle with the hijackers, and the aircraft crashes in a field near Shanksville, Pennsylvania, killing all on board.', ' September 11 , American Airlines Flight 11, a Boeing 767-200ER with 92 people on board, is hijacked after taking off from Boston, and is flown into the north tower of the World Trade Center in New York City; all on board are killed as well as around 1600 people on the ground and in the building; the collapse of both towers brings the total death toll from the two crashes to at least 2,763, the worst disaster involving commercial aircraft.', ' September 11 , United Airlines Flight 175, a Boeing 767-200 with 65 people on board, is hijacked after taking off from Boston and is flown into the south tower of the World Trade Center in New York City; all on board are killed as well as around 900 people on the ground and in the building; the collapse of both towers brings the total death toll from the two crashes to at least 2,763, the worst disaster involving commercial aircraft.', ' September 11 , American Airlines Flight 77, a Boeing 757-200 with 64 people on board, is hijacked after taking off from Dulles International Airport and is flown into The Pentagon; all on board are killed as well as 125 people in the building and on the ground.', ' September 11 , United Airlines Flight 93, a Boeing 757-200 with 44 people on board, is hijacked after taking off from Newark, New Jersey; passengers struggle with the hijackers, and the aircraft crashes in a field near Shanksville, Pennsylvania, killing all on board.', ' October 4 , Siberia Airlines Flight 1812, a Tupolev Tu-154, is shot down by the Ukrainian military over the Black Sea. All 66 passengers and 12 crew members are killed.', ' October 8 , In the Linate Airport disaster, Scandinavian Airlines Flight 686, an MD-87, crashes into a Cessna business jet on takeoff from Milan, Italy. The MD-87 then swerves into a baggage handling building and catches fire. All 110 people on board Flight 686 die as well as all four in the Cessna. Four people on the ground are also killed.', " November 12 , American Airlines Flight 587, an Airbus A300, crashes into a Queens neighborhood in New York City when the plane's vertical tail fin snaps off just after takeoff due to overuse of the rudder by the first officer during a wake turbulence encounter. All 251 passengers and nine crew members on board are killed as well as five people on the ground.", ' November 24 , Crossair Flight 3597, an Avro RJ100, crashes near Bassersdorf, Switzerland, while attempting to land in Zürich. Of the 28 passengers and five crew members on board, 21 passengers and three crew members die.', ' December 22 , On board American Airlines Flight 63, a Boeing 767, a passenger, Richard Reid, attempts to detonate explosives hidden in his shoes, but fails and is subdued by two flight attendants and passengers. The plane lands safely in Boston.', '2002 January 14 , Lion Air Flight 386, a Boeing 737-200, crashes while attempting to take off from Riau, Indonesia; all 103 on board survive.', '2002 January 16 , Garuda Indonesia Flight 421, a Boeing 737-300, experiences a dual flameout after entering a thunderstorm, and ditches in the Bengawan Solo River. A flight attendant is the only casualt

In [48]:
# [CIS 545 Test Cases] (2 pts)
# Very basic testing of your dataframe...

if len(clean_incidents) < 330 or len(clean_incidents) > 335: #331 expected
    raise ValueError("Don't have the expected number of entries")

if not clean_incidents[0].startswith('1997'):
    raise ValueError("Don't have the expected start date")
    
print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [49]:
# [CIS 545 Test Cases] (2 pts)
# Checking the values in clean_incidents


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [50]:
# [CIS 545 Test Cases] (2 pts)
# Checking the values in clean_incidents


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [51]:
# [CIS 545 Test Cases] (2 pts)
# Checking the values in clean_incidents


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

Now that we have all the aircraft incidents since 1997, we need to convert them into a Pandas DataFrame. Use the empty dataframe `incidents_df`.  For each entry in clean_incidents, extract the date, airline name and flight number (only the part that comes after `Flight`, and you should remove what are called "stop words" like a, an, the) then store it as a new row in `incidents_df`. Set the column type of `incidents_df['Date']` to `datetime`. Drop any duplicates from `incidents_df`.

In [52]:
!pip install nltk --user

Requirement already satisfied: nltk in /home/jovyan/.local/lib/python3.6/site-packages (3.4)
Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from nltk) (1.12.0)
Requirement already satisfied: singledispatch in /home/jovyan/.local/lib/python3.6/site-packages (from nltk) (3.4.0.3)

In [53]:
import nltk
nltk.download('stopwords')
nltk.download('punkt')
from nltk.corpus import stopwords

[nltk_data] Downloading package stopwords to /home/jovyan/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!
[nltk_data] Downloading package punkt to /home/jovyan/nltk_data...
[nltk_data]   Package punkt is already up-to-date!

In [54]:
print(clean_incidents[0])

1997 January 9 , Comair Flight 3272, an Embraer EMB 120 Brasília, crashes near Ida, Michigan, during a snowstorm, killing all 29 on board.

In [91]:
# TODO: Convert clean_incidents into dataframe incidents_df

# You might find the Natural Language Toolkit (nltk) useful.
# See https://www.nltk.org/ for details.
#
# The stopwords module will let you find and remove not-very-useful
# words like articles ('the', 'a'). (We imported it earlier in the assignment)
import re
from nltk.tokenize import word_tokenize 
incidents_df = []
incidents_df = pd.DataFrame(columns = ['Date', 'Airline', 'FlightNum'])
stop_words = set(stopwords.words('english'))
for item in clean_incidents:
    tokens = word_tokenize(item)
    if re.match(r'[0-9]+', tokens[0]):
        year = tokens[0]
    no_stopword = [w for w in tokens if w not in stop_words]
    id_flight = no_stopword.index('Flight')
    id_airline_name = no_stopword.index(',')
    date=''
    for i in range(0, id_airline_name-1):
        date=date + no_stopword[i]+' '
    date = date + no_stopword[id_airline_name -1]
    if id_airline_name < 3:
        date = year + ' ' + date
    name = ''
    for i in range(id_airline_name+1, id_flight-1):
        name = name + no_stopword[i]+' '
    name = name + no_stopword[id_flight -1]
    if re.match(r'[0-9]*', no_stopword[id_flight + 1]):
        flight_num = ''.join(no_stopword[id_flight + 1])
    entity = {'Date' : date, 'Airline' : name, 'FlightNum' : flight_num}
    incidents_df = incidents_df.append(entity, ignore_index = True)

In [92]:
print(incidents_df)

                  Date                            Airline FlightNum
0       1997 January 9                             Comair      3272
1        1997 March 18  Stavropolskaya Aktsionernaya Avia      1023
2        1997 April 19         Merpati Nusantara Airlines       106
3           1997 May 8            China Southern Airlines      3456
4         1997 July 31                      FedEx Express        14
5         1997 July 17                        Sempati Air       304
6        1997 August 6                         Korean Air       801
7       1997 August 10                   Formosa Airlines      7601
8     1997 September 3                   Vietnam Airlines       815
9     1997 September 6              Royal Brunei Airlines       238
10   1997 September 26                   Garuda Indonesia       152
11     1997 October 10              Austral Líneas Aéreas      2553
12    1997 December 15                Tajikistan Airlines      3183
13    1997 December 17                           Aerosvit       241
14    1997 December 19                            SilkAir       185
15    1997 December 28                    United Airlines       826
16     1998 February 2                       Cebu Pacific       387
17    1998 February 16                     China Airlines       676
18       1998 March 22                Philippine Airlines       137
19       1998 April 20                         Air France       422
20         1998 May 25                                PIA       544
21        1998 June 18                            Propair       420
22        1998 July 30                   Proteus Airlines       706
23      1998 August 24                     Myanma Airways       635
24      1998 August 29                 Cubana de Aviación       389
25    1998 September 2                           Swissair       111
26   1998 September 25                           PauknAir      4101
27   1998 September 29                            Lionair       602
28    1998 December 11         Thai Airways International       261
29    1999 February 24           China Southwest Airlines      4509
..                 ...                                ...       ...
301   2015 September 5    Ceiba Intercontinental Airlines        71
302   2015 September 8                    British Airways      2276
303     2015 October 2                           Aviastar      7503
304    2015 October 29                    Dynamic Airways       405
305    2015 October 31                           Metrojet      9268
306     2016 January 8                    West Air Sweden       294
307    2016 February 2                    Daallo Airlines       159
308   2016 February 24                           Tara Air       193
309      2016 March 19                           Flydubai       981
310      2016 March 29                           EgyptAir       181
311       2016 April 4                          Batik Air      7703
312        2016 May 19                           EgyptAir       804
313        2016 May 27                         Korean Air      2708
314       2016 June 27                 Singapore Airlines       368
315      2016 August 3                           Emirates       521
316      2016 August 5               ASL Airlines Hungary      7332
317     2016 August 27                 Southwest Airlines      3472
318    2016 October 28                  American Airlines       383
319    2016 October 28                      FedEx Express       910
320   2016 November 28                     LaMia Airlines      2933
321    2016 December 7    Pakistan International Airlines       661
322   2016 December 20                          Aerosucre      4544
323   2016 December 23                  Afriqiyah Airways       209
324    2017 January 16                   Turkish Airlines      6491
325      2017 March 28                  Peruvian Airlines       112
326        2017 May 27                         Summit Air       409
327        2017 July 7                         Air Canada       759
328  2017 September 30                         Air France        66
329   2017 December 13                 West Wind Aviation       280
330    2018 January 13                   Pegasus Airlines      8622

[331 rows x 3 columns]

In [93]:
# [CIS 545 Test Cases] (3 pts)
# Checking your dataframe size and shape

if len(incidents_df) < 330 or len(incidents_df) > 335: 
    raise ValueError("Don't have the expected number of entries")

if incidents_df.shape[1] != 3:
    raise ValueError("Don't have the expected number of fields")

if not ((incidents_df['Airline'] == 'Cebu Pacific') & \
        (incidents_df['Date'] == '1998 February 2') & \
        (incidents_df['FlightNum'] == '387')).any():
    raise ValueError('You might need to clean your data a bit better')
    
print('[CIS 545 Test Cases] (3 pts)')

[CIS 545 Test Cases] (3 pts)

In [94]:
# [CIS 545 Test Cases] (2 pts)
# We're going to be testing your data cleaning more thoroughly here


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

In [95]:
# [CIS 545 Test Cases] (2 pts)
# We're going to be testing your data cleaning more thoroughly here


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

Now, we want to change the column type and clean data a bit further

In [96]:
# TODO: Change column type of 'Date' and drop duplicates
from datetime import datetime
incidents_df.dropna(axis=0, how="any", \
                 inplace=True)
#print(incidents_df['Date'])
for i in range(len(incidents_df['Date'])):
    incidents_df['Date'][i] = datetime.strptime(incidents_df['Date'][i], '%Y %B %d')
incidents_df['Date'] = pd.to_datetime(incidents_df['Date'], format = '%Y-%B-%d')
incidents_df.drop_duplicates(inplace=True)
print(incidents_df['Date'])

0     1997-01-09
1     1997-03-18
2     1997-04-19
3     1997-05-08
4     1997-07-31
5     1997-07-17
6     1997-08-06
7     1997-08-10
8     1997-09-03
9     1997-09-06
10    1997-09-26
11    1997-10-10
12    1997-12-15
13    1997-12-17
14    1997-12-19
15    1997-12-28
16    1998-02-02
17    1998-02-16
18    1998-03-22
19    1998-04-20
20    1998-05-25
21    1998-06-18
22    1998-07-30
23    1998-08-24
24    1998-08-29
25    1998-09-02
26    1998-09-25
27    1998-09-29
28    1998-12-11
29    1999-02-24
         ...
301   2015-09-05
302   2015-09-08
303   2015-10-02
304   2015-10-29
305   2015-10-31
306   2016-01-08
307   2016-02-02
308   2016-02-24
309   2016-03-19
310   2016-03-29
311   2016-04-04
312   2016-05-19
313   2016-05-27
314   2016-06-27
315   2016-08-03
316   2016-08-05
317   2016-08-27
318   2016-10-28
319   2016-10-28
320   2016-11-28
321   2016-12-07
322   2016-12-20
323   2016-12-23
324   2017-01-16
325   2017-03-28
326   2017-05-27
327   2017-07-07
328   2017-09-30
329   2017-12-13
330   2018-01-13
Name: Date, Length: 322, dtype: datetime64[ns]

In [97]:
# [CIS 545 Test Cases] (2 pts)


print('[CIS 545 Test Cases] (2 pts)')

[CIS 545 Test Cases] (2 pts)

## Final Output

The following cells just show what the data looks like.  You should sanity check that it makes sense.

In [98]:
airports_df.head(10)

,airport_id,airport_name,airport_city,airport_country,airport_iata,airport_icao,lat,lon,alt,timezone,dst,tz
0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10.0,U,Pacific/Port_Moresby
1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.788700,20,10.0,U,Pacific/Port_Moresby
2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10.0,U,Pacific/Port_Moresby
3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10.0,U,Pacific/Port_Moresby
4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.220050,146,10.0,U,Pacific/Port_Moresby
5,6,Wewak Intl,Wewak,Papua New Guinea,WWK,AYWK,-3.583828,143.669186,19,10.0,U,Pacific/Port_Moresby
6,7,Narsarsuaq,Narssarssuaq,Greenland,UAK,BGBW,61.160517,-45.425978,112,-3.0,E,America/Godthab
7,8,Nuuk,Godthaab,Greenland,GOH,BGGH,64.190922,-51.678064,283,-3.0,E,America/Godthab
8,9,Sondre Stromfjord,Sondrestrom,Greenland,SFJ,BGSF,67.016969,-50.689325,165,-3.0,E,America/Godthab
9,10,Thule Air Base,Thule,Greenland,THU,BGTL,76.531203,-68.703161,251,-4.0,E,America/Thule

In [99]:
airlines_df.head(10)

,airline_id,airline_name,alias,airline_iata,airline_icao,callsign,airline_country,active
0,1,Private flight,,-,,,,Y
1,2,135 Airways,,,GNL,GENERAL,United States,N
2,3,1Time Airline,,1T,RNX,NEXTIME,South Africa,Y
3,4,2 Sqn No 1 Elementary Flying Training School,,,WYT,,United Kingdom,N
4,5,213 Flight Unit,,,TFU,,Russia,N
5,6,223 Flight Unit State Airline,,,CHD,CHKALOVSK-AVIA,Russia,N
6,7,224th Flight Unit,,,TTF,CARGO UNIT,Russia,N
7,8,247 Jet Ltd,,,TWF,CLOUD RUNNER,United Kingdom,N
8,9,3D Aviation,,,SEC,SECUREX,United States,N
9,10,40-Mile Air,,Q5,MLA,MILE-AIR,United States,Y

In [100]:
routes_df.head(10)

,airline,airline_id,src_iata_icao,source_id,target_iata_icao,target_id,code_share,stops,equipment
0,2B,410,AER,2965,KZN,2990,,0,CR2
1,2B,410,ASF,2966,KZN,2990,,0,CR2
2,2B,410,ASF,2966,MRV,2962,,0,CR2
3,2B,410,CEK,2968,KZN,2990,,0,CR2
4,2B,410,CEK,2968,OVB,4078,,0,CR2
5,2B,410,DME,4029,KZN,2990,,0,CR2
6,2B,410,DME,4029,NBC,6969,,0,CR2
8,2B,410,DME,4029,UUA,6160,,0,CR2
9,2B,410,EGO,6156,KGD,2952,,0,CR2
10,2B,410,EGO,6156,KZN,2990,,0,CR2

In [101]:
incidents_df.head(10)

        Date                            Airline FlightNum
0 1997-01-09                             Comair      3272
1 1997-03-18  Stavropolskaya Aktsionernaya Avia      1023
2 1997-04-19         Merpati Nusantara Airlines       106
3 1997-05-08            China Southern Airlines      3456
4 1997-07-31                      FedEx Express        14
5 1997-07-17                        Sempati Air       304
6 1997-08-06                         Korean Air       801
7 1997-08-10                   Formosa Airlines      7601
8 1997-09-03                   Vietnam Airlines       815
9 1997-09-06              Royal Brunei Airlines       238

## Step 3: Making Data “Persistent”

Now let’s actually save the data in a persistent way, specifically using a relational database.  For simplicity we’ll use SQLite here, but we could alternatively use a DBMS such as MySQL or PostgreSQL on the cloud (or in another Docker container).

The cell below establishes a connection to an SQLite database, which will be written to the file HW1_DB in your HW1 Jupyter directory.

In [102]:
# sqlite3 allows for use of SQL queries in Python. Just run this cell, no edits needed!
import sqlite3
engine = sqlite3.connect('HW1_DB')

Now save each of your DataFrames (`airlines_df`, `airports_df`, `flights_df`, `routes_df`, `incidents_df`) to the database.  To do this, call the `to_sql` method (make sure to not save the `index` column since it doesn't matter!) on the DataFrame.  Give it a table name matching the DataFrame name, and set the flag `if_exists=’replace’` in case you want to run this multiple times.

Once this is all done, you can move on to Homework 1, Part 2, which will use the DataFrames saved to the SQL database.

In [103]:
# TODO: Use to_sql to save your Dataframes to the HW1_DB
airlines_df.to_sql("airlines_df", con=engine, if_exists='replace', index=False)
airports_df.to_sql("airports_df", con=engine, if_exists='replace',index=False)
flights_df.to_sql("flights_df", con=engine, if_exists='replace', index=False)
routes_df.to_sql("routes_df", con=engine, if_exists='replace', index=False)
incidents_df.to_sql("incidents_df", con=engine, if_exists='replace',  index=False)

In [104]:
# Test that the data is there!
# No points for this test case!

cursor = engine.execute('select * from airports limit 1000')
rows = cursor.fetchall()

# View some data
for i in range(10):
    print(rows[i])

if len(rows) < 1000:
    raise ValueError('Somehow fewer than 1000 airports were written')

(1, 'Goroka', 'Goroka', 'Papua New Guinea', 'GKA', 'AYGA', -6.081689, 145.391881, 5282, 10.0, 'U', 'Pacific/Port_Moresby')
(2, 'Madang', 'Madang', 'Papua New Guinea', 'MAG', 'AYMD', -5.207083, 145.7887, 20, 10.0, 'U', 'Pacific/Port_Moresby')
(3, 'Mount Hagen', 'Mount Hagen', 'Papua New Guinea', 'HGU', 'AYMH', -5.826789, 144.295861, 5388, 10.0, 'U', 'Pacific/Port_Moresby')
(4, 'Nadzab', 'Nadzab', 'Papua New Guinea', 'LAE', 'AYNZ', -6.569828, 146.72624199999998, 239, 10.0, 'U', 'Pacific/Port_Moresby')
(5, 'Port Moresby Jacksons Intl', 'Port Moresby', 'Papua New Guinea', 'POM', 'AYPY', -9.443383, 147.22005, 146, 10.0, 'U', 'Pacific/Port_Moresby')
(6, 'Wewak Intl', 'Wewak', 'Papua New Guinea', 'WWK', 'AYWK', -3.583828, 143.669186, 19, 10.0, 'U', 'Pacific/Port_Moresby')
(7, 'Narsarsuaq', 'Narssarssuaq', 'Greenland', 'UAK', 'BGBW', 61.160517000000006, -45.425978, 112, -3.0, 'E', 'America/Godthab')
(8, 'Nuuk', 'Godthaab', 'Greenland', 'GOH', 'BGGH', 64.190922, -51.678064, 283, -3.0, 'E', 'America/Godthab')
(9, 'Sondre Stromfjord', 'Sondrestrom', 'Greenland', 'SFJ', 'BGSF', 67.01696899999999, -50.689325, 165, -3.0, 'E', 'America/Godthab')
(10, 'Thule Air Base', 'Thule', 'Greenland', 'THU', 'BGTL', 76.531203, -68.703161, 251, -4.0, 'E', 'America/Thule')